Repository: aymenG/Management-System
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# appTitle
source: Car Rental Management System
ar: نظام إدارة تأجير السيارات
fr: Système de Gestion de Location de Voitures

source: Welcome
ar: مرحباً
fr: Bienvenue

source: Home
ar: الرئيسية
fr: Accueil

source: Car Management
ar: إدارة السيارات
fr: Gestion des Voitures

source: Rentals
ar: الإيجارات
fr: Locations

source: Archive
ar: الأرشيف

source: Settings
ar: الإعدادات
fr: Paramètres

source: Sign Out
ar: تسجيل الخروج
fr: Déconnexion

# closeButton
source: Close
ar: إغلاق
fr: Fermer

# cancelButton
source: Cancel
ar: إلغاء
fr: Annuler

# confirmButton
source: Confirm
ar: تأكيد
fr: Confirmer

# deleteButton
source: Delete
ar: حذف
fr: Supprimer

source: Confirm Exit
ar: تأكيد الخروج
fr: Confirmer la Sortie

# areYouSureToClose
source: Are you sure you want to close the application?
ar: هل أنت متأكد أنك تريد إغلاق التطبيق؟
fr: Êtes-vous sûr de vouloir fermer l'application ?

source: Page Not Found
ar: الصفحة غير موجودة
fr: Page Non Trouvée

# actionCannotBeUndone
source: This action cannot be undone and will move the rental to archives.
ar: لا يمكن التراجع عن هذا الإجراء وسيتم نقل الإيجار إلى الأرشيف.
fr: Cette action est irréversible et déplacera la location vers les archives.

# currencySymbol
source: DZD
ar: د.ج

# dashboardTitle
source: Dashboard Overview
ar: نظرة عامة على لوحة التحكم
fr: Aperçu du Tableau de Bord

source: Daily Income
ar: الدخل اليومي
fr: Revenu Quotidien

source: Monthly Income
ar: الدخل الشهري
fr: Revenu Mensuel

source: Daily Rentals
ar: الإيجارات اليومية
fr: Locations Quotidiennes

source: Monthly Rentals
ar: الإيجارات الشهرية
fr: Locations Mensuelles

# topRentedCars
source: Top 5 Rented Cars
ar: أكثر 5 سيارات تأجيراً
fr: Top 5 des Voitures Louées

# noRentalsYet
source: No rentals recorded yet.
ar: لم يتم تسجيل أي إيجارات بعد.
fr: Aucune location enregistrée pour l'instant.

source: Unknown Car
ar: سيارة غير معروفة
fr: Voiture Inconnue

# numberOfRentals
source: {count, plural, =0{No rentals} one{1 rental} other{{count} rentals}}
ar: {count, plural, =0{لا توجد إيجارات} one{إيجار واحد} two{إيجاران} few{{count} إيجارات} many{{count} إيجار} other{{count} إيجار}}
fr: {count, plural, =0{Aucune location} one{1 location} other{{count} locations}}

# availableCarsTitle
source: Available Cars
ar: السيارات المتاحة
fr: Voitures Disponibles

# addCarButton
source: Add Car
ar: إضافة سيارة
fr: Ajouter une Voiture

# addCarTooltip
source: Add New Car
ar: إضافة سيارة جديدة
fr: Ajouter une Nouvelle Voiture

source: No cars available
ar: لا توجد سيارات متاحة
fr: Aucune voiture disponible

# addFirstCarPrompt
source: Add your first car to get started
ar: أضف سيارتك الأولى للبدء
fr: Ajoutez votre première voiture pour commencer

source: Total Cars
ar: إجمالي السيارات
fr: Total Voitures

source: Rented Cars
ar: السيارات المؤجرة
fr: Voitures Louées

source: Archived Cars
ar: السيارات المؤرشفة
fr: Voitures Archivées

# columnId
source: ID
ar: المعرف

# columnBrand
source: Brand
ar: الماركة
fr: Marque

# columnModel
source: Model
ar: الموديل
fr: Modèle

# columnYear
source: Year
ar: السنة
fr: Année

# columnPlateNumber
source: Plate Number
ar: رقم اللوحة
fr: Numéro de Plaque

# columnDailyPrice
source: Daily Price (DZD)
ar: السعر اليومي (د.ج)
fr: Prix Journalier (DZD)

# columnStatus
source: Status
ar: الحالة
fr: Statut

# columnActions
source: Actions
ar: الإجراءات

source: Plate: {number}
ar: اللوحة: {number}
fr: Plaque : {number}

# carYear
source: Year: {year}
ar: السنة: {year}
fr: Année : {year}

# dailyPrice
source: {price} {currencySymbol}/day
ar: {price} {currencySymbol}/يوم
fr: {price} {currencySymbol}/jour

# rentButton
source: Rent
ar: استئجار السيارة
fr: Louer la voiture

# returnButton
source: Return
ar: إرجاع
fr: Retourner

# editButton
source: Edit
ar: تعديل
fr: Modifier

# editCarTooltip
source: Edit Car
ar: تعديل السيارة
fr: Modifier la Voiture

# archiveCarTooltip
source: Archive Car
ar: أرشفة السيارة
fr: Archiver la Voiture

# restoreCarTooltip
source: Restore Car
ar: استعادة السيارة
fr: Restaurer la Voiture

# deleteCarTooltip
source: Delete Car Permanently
ar: حذف السيارة نهائياً
fr: Supprimer la Voiture Définitivement

# carStatusAvailable
source: Available
ar: متاحة
fr: Disponible

# carStatusRented
source: Rented
ar: مؤجرة
fr: Louée

# carStatusUnderMaintenance
source: Under Maintenance
ar: تحت الصيانة
fr: En Maintenance

# carStatusArchived
source: Archived
ar: مؤرشفة
fr: Archivée

# confirmArchiveTitle
source: Confirm Archiving
ar: تأكيد الأرشفة
fr: Confirmer l'Archivage

# archiveCarConfirmation
source: Are you sure you want to archive this car? It will be moved to the archive page.
ar: هل أنت متأكد أنك تريد أرشفة هذه السيارة؟ سيتم نقلها إلى صفحة الأرشيف.
fr: Êtes-vous sûr de vouloir archiver cette voiture ? Elle sera déplacée vers la page d'archive.

# carArchivedSuccess
source: Car archived successfully!
ar: تم أرشفة السيارة بنجاح!
fr: Voiture archivée avec succès !

source: Error archiving car
ar: خطأ في أرشفة السيارة
fr: Erreur lors de l'archivage de la voiture

# returnCarTitle
source: Return Car
ar: إرجاع السيارة
fr: Retourner la Voiture

# returnCarConfirmation
source: Are you sure you want to return this car?
ar: هل أنت متأكد أنك تريد إرجاع هذه السيارة؟
fr: Êtes-vous sûr de vouloir retourner cette voiture ?

# carStatusUpdated
source: Car status updated to {status}!
ar: تم تحديث حالة السيارة إلى {status}!
fr: Statut de la voiture mis à jour vers {status} !

source: Error updating car status
ar: خطأ في تحديث حالة السيارة
fr: Erreur lors de la mise à jour du statut de la voiture

# confirmDeleteTitle
source: Confirm Permanent Deletion
ar: تأكيد الحذف النهائي
fr: Confirmer la Suppression Permanente

# deleteCarConfirmation
source: Are you sure you want to permanently delete this car?
ar: هل أنت متأكد أنك تريد حذف هذه السيارة نهائياً؟
fr: Êtes-vous sûr de vouloir supprimer définitivement cette voiture ?

# carDeletedSuccess
source: Car deleted permanently!
ar: تم حذف السيارة نهائياً!
fr: Voiture supprimée définitivement !

source: Error deleting car
ar: خطأ في حذف السيارة
fr: Erreur lors de la suppression de la voiture

source: Error loading cars
ar: خطأ في تحميل السيارات
fr: Erreur lors du chargement des voitures

# addCarPageTitle
source: Add New Car
ar: إضافة سيارة جديدة
fr: Ajouter une Nouvelle Voiture

# carBrandLabel
source: Car Brand
ar: ماركة السيارة
fr: Marque de la Voiture

# carModelLabel
source: Car Model
ar: موديل السيارة
fr: Modèle de la Voiture

# manufacturingYearLabel
source: Manufacturing Year
ar: سنة الصنع
fr: Année de Fabrication

# plateNumberLabel
source: Plate Number
ar: رقم اللوحة
fr: Numéro de Plaque

# dailyRentalRateLabel
source: Daily Rental Rate
ar: سعر الإيجار اليومي
fr: Tarif de Location Journalier

# carStatusLabel
source: Car Status
ar: حالة السيارة
fr: Statut de la Voiture

# saveButton
source: Save
ar: حفظ
fr: Enregistrer

# errorAddCar
source: Error adding car
ar: خطأ في إضافة السيارة
fr: Erreur lors de l'ajout de la voiture

# carAddedSuccess
source: Car added successfully!
ar: تمت إضافة السيارة بنجاح!
fr: Voiture ajoutée avec succès !

# carStatusPrompt
source: Select Car Status
ar: اختر حالة السيارة
fr: Sélectionnez le statut de la voiture

# carUpdateSuccess
source: Car updated successfully!
ar: تم تحديث السيارة بنجاح!
fr: Voiture mise à jour avec succès !

# errorUpdateCar
source: Error updating car
ar: خطأ في تحديث السيارة
fr: Erreur lors de la mise à jour de la voiture

# editCarPageTitle
source: Edit Car Details
ar: تعديل تفاصيل السيارة
fr: Modifier les Détails de la Voiture

# rentalsPageTitle
source: Active & Past Rentals
ar: الإيجارات النشطة والسابقة
fr: Locations Actives & Passées

# exportRentalsButton
source: Export Rentals to Excel
ar: تصدير الإيجارات إلى Excel
fr: Exporter les Locations vers Excel

# pickDateRangeTitle
source: Pick Date Range
ar: اختيار نطاق التاريخ
fr: Sélectionner la Plage de Dates

# noRentalsInDateRange
source: No rentals found in selected range
ar: لم يتم العثور على إيجارات في النطاق الزمني المحدد.
fr: Aucune location trouvée dans la plage de dates sélectionnée.

# exportSuccess
source: Rentals exported successfully!
ar: تم تصدير الإيجارات بنجاح!
fr: Locations exportées avec succès !

# noRentalsFound
source: No rentals found yet!
ar: لم يتم العثور على إيجارات بعد!
fr: Aucune location trouvée pour l'instant !

# addRentalHint
source: Start by adding a new car rental.
ar: ابدأ بإضافة إيجار سيارة جديد.
fr: Commencez par ajouter une nouvelle location de voiture.

# rentalIdHeader
source: ID
ar: المعرف

# customerHeader
source: Customer
ar: العميل
fr: Client

# carBrandHeader
source: Car Brand
ar: ماركة السيارة
fr: Marque

# carModelHeader
source: Car Model
ar: موديل السيارة
fr: Modèle

# plateNumberHeader
source: Plate Number
ar: رقم اللوحة
fr: Numéro de Plaque

# rentDateHeader
source: Rent Date
ar: تاريخ الإيجار
fr: Date de Location

# returnDateHeader
source: Return Date
ar: تاريخ الإرجاع
fr: Date de Retour

# totalPriceHeader
source: Total Price ({currencySymbol})
ar: السعر الإجمالي ({currencySymbol})
fr: Prix Total ({currencySymbol})

# actionsHeader
source: Actions
ar: الإجراءات

# editRentalTooltip
source: Edit Rental
ar: تعديل الإيجار
fr: Modifier la Location

# deleteRentalTooltip
source: Delete Rental
ar: حذف الإيجار
fr: Supprimer la Location

source: Error loading rentals
ar: خطأ في تحميل الإيجارات
fr: Erreur lors du chargement des locations

# rentalUpdatedSuccess
source: Rental updated successfully!
ar: تم تحديث الإيجار بنجاح!
fr: Location mise à jour avec succès !

# errorRentalNotFound
source: Error: Rental with ID {id} not found for editing.
ar: خطأ: لم يتم العثور على الإيجار بالمعرف {id} للتعديل.
fr: Erreur : Location avec l'ID {id} introuvable pour la modification.

# errorEditNullRentalId
source: Error: Attempted to edit a rental with a null ID.
ar: خطأ: محاولة تعديل إيجار بمعرف فارغ.
fr: Erreur : Tentative de modification d'une location avec un ID nul.

# errorDeleteNullRentalId
source: Error: Attempted to delete a rental with a null ID.
ar: خطأ: محاولة حذف إيجار بمعرف فارغ.
fr: Erreur : Tentative de suppression d'une location avec un ID nul.

# confirmDeletionTitle
source: Confirm Deletion
ar: تأكيد الحذف
fr: Confirmer la Suppression

# deleteRentalConfirmation
source: Are you sure you want to delete this rental?
ar: هل أنت متأكد أنك تريد حذف هذا الإيجار؟
fr: Êtes-vous sûr de vouloir supprimer cette location ?

# rentalDeletedSuccess
source: Rental deleted successfully!
ar: تم حذف الإيجار بنجاح!
fr: Location supprimée avec succès !

source: Error deleting rental
ar: خطأ في حذف الإيجار
fr: Erreur lors de la suppression de la location

# addRentalButton
source: Add New Rental
ar: إضافة إيجار جديد
fr: Ajouter une Nouvelle Location

# confirmBookingTitle
source: Confirm Rental Booking
ar: تأكيد حجز الإيجار
fr: Confirmer la Réservation de Location

# confirmBookingMessage
source: Are you sure you want to book this rental?
ar: هل أنت متأكد أنك تريد حجز هذا الإيجار؟
fr: Êtes-vous sûr de vouloir réserver cette location ?

# customerNameLabel
source: Customer Name
ar: اسم العميل
fr: Nom du Client

# customerPhoneLabel
source: Customer Phone
ar: هاتف العميل
fr: Téléphone du Client

# rentDateLabel
source: Rent Date
ar: تاريخ الإيجار
fr: Date de Location

# returnDateLabel
source: Return Date
ar: تاريخ الإرجاع
fr: Date de Retour

# totalPriceLabel
source: Total Price
ar: السعر الإجمالي
fr: Prix Total

source: Error booking rental
ar: خطأ في حجز الإيجار
fr: Erreur lors de la réservation de la location

# rentalBookedSuccess
source: Rental booked successfully!
ar: تم حجز الإيجار بنجاح!
fr: Location réservée avec succès !

# selectCustomerMessage
source: Select Customer
ar: اختر العميل
fr: Sélectionner un Client

source: No customer selected
ar: لم يتم اختيار عميل
fr: Aucun client sélectionné

# pickCustomerTitle
source: Pick a Customer
ar: اختر عميلاً
fr: Sélectionner un Client

# customerSearchHint
source: Search customers...
ar: البحث عن عملاء...
fr: Rechercher des clients...

# addNewCustomerButton
source: Add New Customer
ar: إضافة عميل جديد
fr: Ajouter un Nouveau Client

# addCustomerDialogTitle
source: Add New Customer
ar: إضافة عميل جديد
fr: Ajouter un Nouveau Client

# customerNameHint
source: Enter customer name
ar: أدخل اسم العميل
fr: Entrez le nom du client

# customerPhoneHint
source: Enter customer phone
ar: أدخل رقم هاتف العميل
fr: Entrez le téléphone du client

# customerAddressHint
source: Enter customer address (optional)
ar: أدخل عنوان العميل (اختياري)
fr: Entrez l'adresse du client (facultatif)

# errorAddCustomer
source: Error adding customer
ar: خطأ في إضافة العميل
fr: Erreur lors de l'ajout du client

# customerAddedSuccess
source: Customer added successfully!
ar: تمت إضافة العميل بنجاح!
fr: Client ajouté avec succès !

# selectCarMessage
source: Select Car
ar: اختر السيارة
fr: Sélectionner une Voiture

# carSearchHint
source: Search cars...
ar: البحث عن سيارات...
fr: Rechercher des voitures...

# selectCarTitle
source: Select a Car
ar: اختر سيارة
fr: Sélectionner une Voiture

source: No car selected
ar: لم يتم اختيار سيارة
fr: Aucune voiture sélectionnée

# archivePageTitle
source: Archived Items
ar: العناصر المؤرشفة
fr: Éléments Archivés

# archivedCarsTab
source: Archived Cars
ar: السيارات المؤرشفة
fr: Voitures Archivées

# archivedRentalsTab
source: Archived Rentals
ar: الإيجارات المؤرشفة
fr: Locations Archivées

source: No archived cars found!
ar: لا توجد سيارات مؤرشفة!
fr: Aucune voiture archivée trouvée !

source: No archived rentals found!
ar: لا توجد إيجارات مؤرشفة!
fr: Aucune location archivée trouvée !

# archivedRentalsAppearHere
source: Rentals you archive will appear here.
ar: الإيجارات التي تقوم بأرشفتها ستظهر هنا.
fr: Les locations que vous archivez apparaîtront ici.

# restoreCarButton
source: Restore Car
ar: استعادة السيارة
fr: Restaurer la Voiture

# deletePermanentlyButton
source: Delete Permanently
ar: حذف نهائياً
fr: Supprimer Définitivement

# permanentDeleteCarConfirmation
source: Are you sure you want to PERMANENTLY delete this car? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذه السيارة بشكل دائم؟ لا يمكن التراجع عن هذا الإجراء.
fr: Êtes-vous sûr de vouloir supprimer DÉFINITIVEMENT cette voiture ? Cette action est irréversible.

# carRestoredSuccess
source: Car restored successfully!
ar: تم استعادة السيارة بنجاح!
fr: Voiture restaurée avec succès !

source: Error restoring car
ar: خطأ في استعادة السيارة
fr: Erreur lors de la restauration de la voiture

source: Car permanently deleted!
ar: تم حذف السيارة نهائياً!
fr: Voiture supprimée définitivement !

source: Error deleting car permanently
ar: خطأ في حذف السيارة نهائياً
fr: Erreur lors de la suppression définitive de la voiture

# restoreRentalButton
source: Restore Rental
ar: استعادة الإيجار
fr: Restaurer la Location

# permanentDeleteRentalConfirmation
source: Are you sure you want to PERMANENTLY delete this rental? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذا الإيجار بشكل دائم؟ لا يمكن التراجع عن هذا الإجراء.
fr: Êtes-vous sûr de vouloir supprimer DÉFINITIVEMENT cette location ? Cette action est irréversible.

# rentalRestoredSuccess
source: Rental restored successfully!
ar: تم استعادة الإيجار بنجاح!
fr: Location restaurée avec succès !

source: Error restoring rental
ar: خطأ في استعادة الإيجار
fr: Erreur lors de la restauration de la location

source: Rental permanently deleted!
ar: تم حذف الإيجار نهائياً!
fr: Location supprimée définitivement !

source: Error deleting rental permanently
ar: خطأ في حذف الإيجار نهائياً
fr: Erreur lors de la suppression définitive de la location

# loginEnterCredentials
source: Please enter both username and password.
ar: الرجاء إدخال اسم المستخدم وكلمة المرور.
fr: Veuillez entrer le nom d'utilisateur et le mot de passe.

# loginUserNotFound
source: User not found.
ar: المستخدم غير موجود.
fr: Utilisateur introuvable.

# loginWelcome
source: Welcome, {username}!
ar: مرحباً بك، {username}!
fr: Bienvenue, {username} !

# loginIncorrectPassword
source: Incorrect password.
ar: كلمة المرور خاطئة.
fr: Mot de passe incorrect.

# loginTitle
source: Login to your account
ar: تسجيل الدخول إلى حسابك
fr: Connectez-vous à votre compte

# loginUsernameLabel
source: Enter your username
ar: أدخل اسم المستخدم الخاص بك
fr: Entrez votre nom d'utilisateur

# loginPasswordLabel
source: Enter your password
ar: أدخل كلمة المرور الخاصة بك
fr: Entrez votre mot de passe

# loginButton
source: Login
ar: تسجيل الدخول
fr: Connexion

# archiveRestoreTitle
source: Restore
ar: استعادة
fr: Restaurer

# archiveConfirmRestore
source: Are you sure you want to restore this item?
ar: هل أنت متأكد أنك تريد استعادة هذا العنصر؟
fr: Êtes-vous sûr de vouloir restaurer cet élément ?

# archiveCarsTab
source: Cars
ar: السيارات
fr: Voitures

# archiveRentalsTab
source: Rentals
ar: الإيجارات
fr: Locations

# archiveNoArchivedCars
source: No archived cars.
ar: لا توجد سيارات مؤرشفة.
fr: Aucune voiture archivée.

# archiveRestoreCarTooltip
source: Restore Car
ar: استعادة السيارة
fr: Restaurer la Voiture

# archiveNoArchivedRentals
source: No archived rentals.
ar: لا توجد إيجارات مؤرشفة.
fr: Aucune location archivée.

# archiveUnknownCustomer
source: Unknown Customer
ar: عميل غير معروف
fr: Client Inconnu

# archiveRentalDetails
source: Car: {brand} {model} - Plate: {plateNumber} Rent: {rentDate} â†’ Return: {returnDate}
ar: السيارة: {brand} {model} - اللوحة: {plateNumber} الإيجار: {rentDate} ← الإرجاع: {returnDate}
fr: Voiture : {brand} {model} - Plaque : {plateNumber} Location : {rentDate} → Retour : {returnDate}

# archiveRestoreRentalTooltip
source: Restore Rental
ar: استعادة الإيجار
fr: Restaurer la Location

# settingsPageTitle
source: Settings
ar: الإعدادات
fr: Paramètres

# settingsAdminDefaultUsername
source: Admin
ar: المسؤول

# settingsAdminRole
source: Role: System Administrator
ar: الدور: مدير النظام
fr: Rôle : Administrateur Système

# settingsUpdateCredentialsTitle
source: Update Credentials
ar: تحديث بيانات الاعتماد
fr: Mettre à Jour les Informations d'Identification

# settingsUsernameLabel
source: Username
ar: اسم المستخدم
fr: Nom d'utilisateur

# settingsCurrentPasswordLabel
source: Current Password
ar: كلمة المرور الحالية
fr: Mot de passe actuel

# settingsNewPasswordLabel
source: New Password (optional)
ar: كلمة المرور الجديدة (اختياري)
fr: Nouveau mot de passe (facultatif)

# settingsSaveChangesButton
source: Save Changes
ar: حفظ التغييرات
fr: Enregistrer les modifications

# settingsFillRequiredFields
source: Please fill in the required fields.
ar: الرجاء ملء الحقول المطلوبة.
fr: Veuillez remplir les champs obligatoires.

# settingsAdminNotFound
source: Admin not found.
ar: لم يتم العثور على المسؤول.
fr: Administrateur introuvable.

# settingsCurrentPasswordIncorrect
source: Current password is incorrect.
ar: كلمة المرور الحالية غير صحيحة.
fr: Le mot de passe actuel est incorrect.

# settingsCredentialsUpdatedSuccess
source: Credentials updated successfully!
ar: تم تحديث بيانات الاعتماد بنجاح!
fr: Informations d'identification mises à jour avec succès !

# carFormEditDialogTitle
source: Edit Car
ar: تعديل السيارة
fr: Modifier la Voiture

# carFormAddDialogTitle
source: Add Car
ar: إضافة سيارة
fr: Ajouter une Voiture

# carFormBrandDropdownLabel
source: Brand
ar: الماركة
fr: Marque

# carFormSelectBrandValidationError
source: Please select a brand
ar: الرجاء اختيار ماركة
fr: Veuillez sélectionner une marque

# carFormModelTextFieldLabel
source: Model
ar: الموديل
fr: Modèle

# carFormEnterModelValidationError
source: Enter a model
ar: أدخل الموديل
fr: Entrez un modèle

# carFormYearTextFieldLabel
source: Year
ar: السنة
fr: Année

# carFormEnterYearValidationError
source: Enter year
ar: أدخل السنة
fr: Entrez l'année

# carFormEnterValidYearValidationError
source: Enter valid year (e.g., 2023)
ar: أدخل سنة صحيحة (مثال: 2023)
fr: Entrez une année valide (ex: 2023)

# carFormPlateNumberTextFieldLabel
source: Plate Number
ar: رقم اللوحة
fr: Numéro de Plaque

# carFormEnterPlateNumberValidationError
source: Enter plate number
ar: أدخل رقم اللوحة
fr: Entrez le numéro de plaque

# carFormEnterDailyPriceValidationError
source: Enter price
ar: أدخل السعر
fr: Entrez le prix

# carFormEnterValidDailyPriceValidationError
source: Enter valid price (greater than 0)
ar: أدخل سعراً صحيحاً (أكبر من 0)
fr: Entrez un prix valide (supérieur à 0)

# carFormStatusDropdownLabel
source: Status
ar: الحالة
fr: Statut

# carFormPickImageButtonLabel
source: Pick Image
ar: اختيار صورة
fr: Choisir une Image

# carFormChangeImageButtonLabel
source: Change Image
ar: تغيير الصورة
fr: Changer l'Image

# editRentalDialogTitle
source: Edit Rental ID: {id}
ar: تعديل الإيجار رقم: {id}
fr: Modifier la location ID : {id}

# editRentalDialogErrorFetchingCars
source: Failed to load cars for editing: {error}
ar: فشل تحميل السيارات للتعديل: {error}
fr: Échec du chargement des voitures pour la modification : {error}

# editRentalDialogCustomerNameLabel
source: Customer Name *
ar: اسم العميل *
fr: Nom du client *

# editRentalDialogCustomerNameValidation
source: Please enter customer name
ar: الرجاء إدخال اسم العميل
fr: Veuillez entrer le nom du client

# editRentalDialogCarLabel
source: Car *
ar: السيارة *
fr: Voiture *

# editRentalDialogNoCarsAvailable
source: No cars available. Add cars first.
ar: لا توجد سيارات متاحة. الرجاء إضافة سيارات أولاً.
fr: Aucune voiture disponible. Ajoutez des voitures d'abord.

# editRentalDialogPleaseSelectCarValidation
source: Please select a car
ar: الرجاء اختيار سيارة
fr: Veuillez sélectionner une voiture

# editRentalDialogRentDateLabel
source: Rent Date *
ar: تاريخ الإيجار *
fr: Date de location *

# editRentalDialogReturnDateLabel
source: Return Date *
ar: تاريخ الإرجاع *
fr: Date de retour *

# editRentalDialogRentDateValidation
source: Please select a rent date
ar: الرجاء اختيار تاريخ الإيجار
fr: Veuillez sélectionner une date de location

# editRentalDialogReturnDateValidation
source: Please select a return date
ar: الرجاء اختيار تاريخ الإرجاع
fr: Veuillez sélectionner une date de retour

# editRentalDialogTotalPriceLabel
source: Total Price (DZD) *
ar: السعر الإجمالي (د.ج) *
fr: Prix Total (DZD) *

# editRentalDialogTotalPriceValidation
source: Please enter total price
ar: الرجاء إدخال السعر الإجمالي
fr: Veuillez entrer le prix total

# editRentalDialogInvalidNumberValidation
source: Please enter a valid number
ar: الرجاء إدخال رقم صحيح
fr: Veuillez entrer un nombre valide

# editRentalDialogSelectCarSnackBar
source: Please select a car.
ar: الرجاء اختيار سيارة.
fr: Veuillez sélectionner une voiture.

# editRentalDialogRentDateRequiredSnackBar
source: Rent Date is required.
ar: تاريخ الإيجار مطلوب.
fr: La date de location est requise.

# editRentalDialogReturnDateRequiredSnackBar
source: Return Date is required.
ar: تاريخ الإرجاع مطلوب.
fr: La date de retour est requise.

# editRentalDialogReturnDateBeforeRentDateSnackBar
source: Return Date must be after Rent Date.
ar: يجب أن يكون تاريخ الإرجاع بعد تاريخ الإيجار.
fr: La date de retour doit être après la date de location.

# editRentalDialogUpdateSuccessSnackBar
source: Rental updated successfully!
ar: تم تحديث الإيجار بنجاح!
fr: Location mise à jour avec succès !

# editRentalDialogUpdateErrorSnackBar
source: Error updating rental: {error}
ar: خطأ أثناء تحديث الإيجار: {error}
fr: Erreur lors de la mise à jour de la location : {error}
